const questions = [
    {
        question: "คุณชอบใช้เวลาว่างของคุณทำอะไร?",
        answers: [
            { text: "นอน นอน นอน" },
            { text: "ดูหนัง อ่านหนังสือ" },
            { text: "เรียนรู้ / ฝึกฝนสิ่งที่ชอบ" },
            { text: "ออกไปแตะหญ้า" },
            { text: "จะเล่นเกมๆๆๆๆ" },
        ]
    },
    {
        question: "คอนเทนต์การสตรีมที่คุณชอบที่สุดคืออะไร?",
        answers: [
            { text: "คุยสบายๆ~" },
            { text: "ร้องเพลง" },
            { text: "เล่นเกม" },
            { text: "วาดรูป" },
            { text: "ทำอาหาร" },
            { text: "🤨" },
        ]
    },
    {
        question: "คำไหนที่อธิบายบุคลิกของคุณได้ดีที่สุด?",
        answers: [
            { text: "สบายๆ และง่ายๆ" },
            { text: "กระตือรือร้นและเต็มไปด้วยพลัง" },
            { text: "อยากรู้อยากเห็นและคิดลึก" },
            { text: "มีความคิดสร้างสรรค์และแสดงออก" },
            { text: "เงียบและสงบ" },
            { text: "มีความเป็นผู้นำสูง" },
        ]
    },
    {
        question: "ถ้าคุณเลือกสัตว์เลี้ยงได้ คุณจะเลือกแบบไหน?",
        answers: [
            { text: "แมวที่ขี้เซานอนข้างๆ" },
            { text: "ลูกสุนัขที่เล่นและมีพลังเต็มที่" },
            { text: "สัตว์แปลกๆ ที่ไม่เหมือนใคร" },
            { text: "นกที่ร้องเพลงได้อย่างไพเราะ" },
            { text: "กระต่ายกินจุ" },
        ]
    },
    {
        question: "คุณทำอย่างไรเมื่อรู้สึกเหนื่อย?",
        answers: [
            { text: "งีบหลับและพักผ่อน" },
            { text: "เข้าฌาน" },
            { text: "หาเพลงฟังเพลินๆ" },
            { text: "ออกไปเดินเล่น" },
            { text: "เม้ามอยกับเพื่อนๆ" },
            { text: "เล่นกับสัตว์เลี้ยง" },
        ]
    },
    {
        question: "เมื่อเกิดเหตุการณ์ที่ไม่คาดคิดขึ้น คุณจะทำอย่างไร?",
        answers: [
            { text: "ยังคงสงบและไหลไปตามสถานการณ์" },
            { text: "ตกใจ ทำตัวไม่ถูก" },
            { text: "วิเคราะห์สถานการณ์อย่างรอบคอบ และหาทางแก้ไข" },
            { text: "ไม่รับรู้ ไม่เห็น ไม่ได้ยินอะไรทั้งนั้น" },
            { text: "หาคำแนะนำจากคนอื่น" }
        ]
    },
    {
        question: "อีโมจิไหนที่แทนคุณได้ดีที่สุด?",
        answers: [
            { text: "😌" },
            { text: "🔥" },
            { text: "🕵️" },
            { text: "🎶" },
            { text: "😊" }
        ]
    },
    {
        question: "ถ้ามีพลังพิเศษ จะเลือกพลังอะไร?",
        answers: [
            { text: "ฉันจะบินๆ ไป~" },
            { text: "ข้าคือความเร็ว" },
            { text: "ไร้เทียมทาน" },
            { text: "ล่องหน 🤨" },
            { text: "ฮีล!" }
        ]
    },
    {
        question: "คุณมีปฏิกิริยาอย่างไรเมื่อได้รับของขวัญ?",
        answers: [
            { text: "ยิ้มและพูดขอบคุณ" },
            { text: "ตื่นเต้นสุดๆ!" },
            { text: "รู้สึกสงสัยว่าทำไมถึงได้รับมัน" },
            { text: "ทำตัวนิ่งๆ เก็บอารมณ์ไว้" },
            { text: "แบ่งปันกับคนอื่น" }
        ]
    },
    {
        question: "ข้อสุดท้าย คุณชอบสีอะไรมากที่สุด?",
        answers: [
            { text: "สีขาว" },
            { text: "สีน้ำเงิน" },
            { text: "สีเทา" },
            { text: "สีทอง" },
        ]
    }
];

const personalities = {
    1: {
        type: "พิอากิ แมว?ตรุษจีน",
        description: "ถึงตรุษจีนจะเลยมาแล้ว แต่พิอากิขอแจกแต๊ะเอีย...<br>เอ๊ะ หรือจะขอรับแทนดีนะ? <br><a href='https://tipme.in.th/akiz-lica' class='secret-description'>ส่งแต๊ะเอียมานะ!</a>",
        image: "images/aki_LNY_cat.png"
    },
    2: {
        type: "พิอากิตอนมองคนที่ไปดูวีคนอื่น",
        description: "แอบไปดูวีอื่นมาใช่ไหม ไปดูใครมา?<br>เอาประวัติการดูมาให้พี่ดูเดี๋ยวนี้!",
        image: "images/aki_angry.png"
    },
    3: {
        type: "พิอากิ หึ",
        description: "หึ!",
        image: "images/aki_smug.png"
    },
    4: {
        type: "พิอากิ",
        description: "มองไรอะ..... มองไรอะ?<br>นิสัยไม่ดี",
        image: "images/aki_mongraia.gif"
    },
    5: {
        type: "เหมียวอากิ",
        description: "เมี๊ยว~ วันนี้อากิเป็นแมวให้แล้วนะ มาลูบหัวได้<br>แต่ต้องมีขนมมาด้วยล่ะ!",
        image: "images/aki_cat_smile.png"
    },
    6: {
        type: "พิอากิอยากนอนแล้วง่า",
        description: "พิอากิง่วงอ่า~ อยากนอนแล้ว~<br>มากล่อมพิอากินอนหน่อยได้มั้ย?",
        image: "images/aki_want_to_sleep.png"
    },
    7: {
        type: "แซนตี้อากิ",
        description: "เซอร์ไพรส์! พิอากิเอาของขวัญมาฝาก<br>จะได้ของขวัญอะไรนะ?",
        image: "images/aki_chirstmas_gift.png"
    },
    8: {
        type: "พิอากิแรมน้อย",
        description: "เออ... หมายความว่าอะไรนะ?<br>พิอากิไม่เข้าใจ",
        image: "images/aki_loading.png"
    }
};

